{
  "_name_or_path": "xlm-roberta-large",
  "architectures": [
    "XLMRobertaForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 1024,
  "id2label": {
    "0": "O",
    "1": "B-Tanggal Putusan",
    "2": "I-Tanggal Putusan",
    "3": "B-Nama Hakim Ketua",
    "4": "I-Nama Hakim Ketua",
    "5": "B-Nama Hakim Anggota",
    "6": "I-Nama Hakim Anggota",
    "7": "B-Nama Panitera",
    "8": "I-Nama Panitera",
    "9": "B-Putusan Hukuman",
    "10": "I-Putusan Hukuman",
    "11": "B-Jenis Amar",
    "12": "I-Jenis Amar",
    "13": "B-Melanggar UU (Pertimbangan Hukum)",
    "14": "I-Melanggar UU (Pertimbangan Hukum)",
    "15": "B-Melanggar UU (Dakwaan)",
    "16": "I-Melanggar UU (Dakwaan)",
    "17": "B-Jenis Dakwaan",
    "18": "I-Jenis Dakwaan",
    "19": "B-Tanggal Kejadian",
    "20": "I-Tanggal Kejadian",
    "21": "B-Nama Saksi",
    "22": "I-Nama Saksi",
    "23": "B-Tuntutan Hukuman",
    "24": "I-Tuntutan Hukuman",
    "25": "B-Melanggar UU (Tuntutan)",
    "26": "I-Melanggar UU (Tuntutan)",
    "27": "B-Jenis Perkara",
    "28": "I-Jenis Perkara",
    "29": "B-Nama Terdakwa",
    "30": "I-Nama Terdakwa",
    "31": "B-Nama Pengadilan",
    "32": "I-Nama Pengadilan",
    "33": "B-Tingkat Kasus",
    "34": "I-Tingkat Kasus",
    "35": "B-Nomor Putusan",
    "36": "I-Nomor Putusan",
    "37": "B-Nama Jaksa",
    "38": "I-Nama Jaksa",
    "39": "B-Nama Pengacara",
    "40": "I-Nama Pengacara"
  },
  "initializer_range": 0.02,
  "intermediate_size": 4096,
  "label2id": {
    "B-Jenis Amar": 11,
    "B-Jenis Dakwaan": 17,
    "B-Jenis Perkara": 27,
    "B-Melanggar UU (Dakwaan)": 15,
    "B-Melanggar UU (Pertimbangan Hukum)": 13,
    "B-Melanggar UU (Tuntutan)": 25,
    "B-Nama Hakim Anggota": 5,
    "B-Nama Hakim Ketua": 3,
    "B-Nama Jaksa": 37,
    "B-Nama Panitera": 7,
    "B-Nama Pengacara": 39,
    "B-Nama Pengadilan": 31,
    "B-Nama Saksi": 21,
    "B-Nama Terdakwa": 29,
    "B-Nomor Putusan": 35,
    "B-Putusan Hukuman": 9,
    "B-Tanggal Kejadian": 19,
    "B-Tanggal Putusan": 1,
    "B-Tingkat Kasus": 33,
    "B-Tuntutan Hukuman": 23,
    "I-Jenis Amar": 12,
    "I-Jenis Dakwaan": 18,
    "I-Jenis Perkara": 28,
    "I-Melanggar UU (Dakwaan)": 16,
    "I-Melanggar UU (Pertimbangan Hukum)": 14,
    "I-Melanggar UU (Tuntutan)": 26,
    "I-Nama Hakim Anggota": 6,
    "I-Nama Hakim Ketua": 4,
    "I-Nama Jaksa": 38,
    "I-Nama Panitera": 8,
    "I-Nama Pengacara": 40,
    "I-Nama Pengadilan": 32,
    "I-Nama Saksi": 22,
    "I-Nama Terdakwa": 30,
    "I-Nomor Putusan": 36,
    "I-Putusan Hukuman": 10,
    "I-Tanggal Kejadian": 20,
    "I-Tanggal Putusan": 2,
    "I-Tingkat Kasus": 34,
    "I-Tuntutan Hukuman": 24,
    "O": 0
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "xlm-roberta",
  "num_attention_heads": 16,
  "num_hidden_layers": 24,
  "output_past": true,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.29.2",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 250002
}
